; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v2 - type_1 ?v6 - type_3)
 	      (pred_1 ?v3 - object ?v6 - type_3)
	      (pred_2 ?v2 - type_1 ?v8 - type_2)
	      (pred_4 ?v2 - type_1 ?v3 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v2 - type_1 ?v4 ?v1 - type_3)
       :precondition (and  (pred_3 ?v2 ?v4))
       :effect (and  (pred_3 ?v2 ?v1)
		     (not (pred_3 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_1 ?v7 - object ?v5 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v5) (pred_3 ?v2 ?v5) (pred_2 ?v2 ?v8))
       :effect (and (pred_4 ?v2 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v5)) 
		    (not (pred_2 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_1 ?v7 - object ?v5 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v7 ?v8) (pred_3 ?v2 ?v5))
       :effect (and (pred_1 ?v7 ?v5)
		    (pred_2 ?v2 ?v8)
		    (not (pred_4 ?v2 ?v7 ?v8)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_08 obj_05 - type_2
obj_06 obj_07 obj_04 - type_3
obj_01 obj_09 obj_03 - object)
(:init
(pred_3 obj_02 obj_04)
(pred_2 obj_02 obj_08)
(pred_2 obj_02 obj_05)
(pred_1 obj_01 obj_04)
(pred_1 obj_09 obj_07)
(pred_1 obj_03 obj_04)
)
(:goal
(and
(pred_1 obj_01 obj_06)
(pred_1 obj_09 obj_06)
(pred_1 obj_03 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_08))))
)
)

; plan
1. (op_1 obj_02 obj_01 obj_04 obj_05)
   deleted: (pred_1 obj_01 obj_04) (pred_2 obj_02 obj_05)
   added: (pred_4 obj_02 obj_01 obj_05)
   goals met: 1 of 3
2. (op_3 obj_02 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_04)
   added: (pred_3 obj_02 obj_07)
   goals met: 1 of 3
3. (op_3 obj_02 obj_07 obj_06)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_06)
   goals met: 1 of 3
4. (op_2 obj_02 obj_01 obj_06 obj_05)
   deleted: (pred_4 obj_02 obj_01 obj_05)
   added: (pred_1 obj_01 obj_06) (pred_2 obj_02 obj_05)
   goals met: 2 of 3
5. (op_3 obj_02 obj_06 obj_07)
   deleted: (pred_3 obj_02 obj_06)
   added: (pred_3 obj_02 obj_07)
   goals met: 2 of 3
6. (op_1 obj_02 obj_09 obj_07 obj_05)
   deleted: (pred_1 obj_09 obj_07) (pred_2 obj_02 obj_05)
   added: (pred_4 obj_02 obj_09 obj_05)
   goals met: 2 of 3
7. (op_3 obj_02 obj_07 obj_06)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_06)
   goals met: 2 of 3
8. (op_2 obj_02 obj_09 obj_06 obj_05)
   deleted: (pred_4 obj_02 obj_09 obj_05)
   added: (pred_1 obj_09 obj_06) (pred_2 obj_02 obj_05)
   goals met: 3 of 3
